moifort/stock-alert/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_CUSTOM_APP_BIN_OFFSET=0x10000

# Flash size and mode for XIAO ESP32-S3 Sense
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM (Sense has 8MB embedded)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Main task stack — HAP pair-setup is CPU-heavy, give it a bit of headroom.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# HAP runtime — non-MFi (no Apple authentication coprocessor on the XIAO).
# This builds the software-auth variant of the SDK, valid for personal /
# uncertified accessories. Production / MFi-certified builds would set
# CONFIG_HAP_MFI_ENABLE=y.
CONFIG_HAP_MFI_ENABLE=n

# Unified provisioning over SoftAP. Avoids pulling in NimBLE just for the
# initial Wi-Fi handoff — Apple Home uses mDNS over IP for pairing anyway,
# so BLE serves no purpose past provisioning.
CONFIG_APP_WIFI_USE_PROVISIONING=y
CONFIG_APP_WIFI_USE_UNIFIED_PROVISIONING=y
CONFIG_APP_WIFI_PROV_TRANSPORT_SOFTAP=y
CONFIG_ENABLE_UNIFIED_PROVISIONING=y

# LwIP — HAP runs several concurrent TCP streams (pair-verify + characteristic
# updates) and needs more sockets than the IDF defaults. Values mirror what
# the smart_outlet HAP example uses.
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_MAX_ACTIVE_TCP=12
CONFIG_LWIP_MAX_LISTENING_TCP=12
CONFIG_LWIP_UDP_RECVMBOX_SIZE=10
CONFIG_LWIP_AUTOIP=y

# Wi-Fi tuning
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# WPA3 + Protected Management Frames support.
# Many recent home routers default to WPA2/WPA3 mixed mode with PMF required.
# Without these, the ESP's auth frames are silently dropped by the AP and the
# station sees only a 1s auth-timeout (`wifi:state: auth -> init`).
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=y
CONFIG_ESP_WIFI_MBEDTLS_CRYPTO=y

# Hardware MPI accelerator — pair-setup uses SRP (large modular exponentiations)
# and pure-software mbedTLS is unusably slow on the S3 (~12s vs ~2s with HW).
CONFIG_MBEDTLS_HARDWARE_MPI=y

# NVS encryption disabled for dev — re-enable for production builds.
CONFIG_NVS_ENCRYPTION=n
